app/Http/Controllers/ProfileController.php

select * from `profiles`
---
    public function index(Request $request)
   {
       $posts = Profile::all()->sortByDesc('updated_at');