app/Http/Controllers/Admin/NewsController.php

  public function create(Request $request)
  {
// 以下を追記
  // Varidationを行う
  $this->validate($request, News::$rules);
      $news = new News;
      $form = $request->all();
      // フォームから画像が送信されてきたら、保存して、$news->image_path に画像のパスを保存する
      if (isset($form['image'])) {
        $path = $request->file('image')->store('public/image');
        $news->image_path = basename($path);
      } else {
          $news->image_path = null;
      }
      // フォームから送信されてきた_tokenを削除する
      unset($form['_token']);
      // フォームから送信されてきたimageを削除する
      unset($form['image']);
      // データベースに保存する
      $news->fill($form);
      $news->save();
---
insert into `news` (`image_path`, `title`, `body`, `updated_at`, `created_at`) values ('', 'postnokoto', 'wanwan', '2020-12-03 10:16:17', '2020-12-03 10:16:17')

  public function index(Request $request)
  {
      $cond_title = $request->cond_title;
      if ($cond_title != '') {
          // 検索されたら検索結果を取得する
          $posts = News::where('title', $cond_title)->get();
      } else {
          // それ以外はすべてのニュースを取得する
          $posts = News::all();
---
select * from `news` where `title` = 'La'
select * from `news`

  public function update(Request $request)
  {
      // Validationをかける
      $this->validate($request, News::$rules);
      // News Modelからデータを取得する
      $news = News::find($request->id);
      // 送信されてきたフォームデータを格納する
      $news_form = $request->all();
      if ($request->remove == 'true') {
          $news_form['image_path'] = null;
      } elseif ($request->file('image')) {
          $path = $request->file('image')->store('public/image');
          $news_form['image_path'] = basename($path);
      } else {
          $news_form['image_path'] = $news->image_path;
      }

      unset($news_form['image']);
      unset($news_form['remove']);
      unset($news_form['_token']);

      // 該当するデータを上書きして保存する
      $news->fill($news_form)->save();

       // 以下を追記
        $history = new History;
        $history->news_id = $news->id;
        $history->edited_at = Carbon::now();
        $history->save();
---
update `news` set `image_path` = 'j5sPvxWba0PQM5TOAqtODbkv5s0X1BkpDSsoXtex.jpeg', `news`.`updated_at` = '2020-12-03 00:03:02' where `id` = 2
insert into `histories` (`news_id`, `edited_at`, `updated_at`, `created_at`) values (2, '2020-12-03 00:03:02', '2020-12-03 00:03:02', '2020-12-03 00:03:02')