app/Http/Controllers/Admin/ProfileController.php

insert into `profiles` (`name`, `gender`, `hobby`, `introduction`, `updated_at`, `created_at`) values ('Yuri-Kokogawa', '男', 'sports', 'エンジニア', '2020-12-03 01:26:28', '2020-12-03 01:26:28')
---
    public function create(Request $request)
    {
        // 以下を追記
  // Varidationを行う
  $this->validate($request, Profile::$rules);
      $profile = new Profile;
      $form = $request->all();

      // フォームから送信されてきた_tokenを削除する
      unset($form['_token']);

      // データベースに保存する
      $profile->fill($form);
      $profile->save();

select * from `profiles`
---
     public function index(Request $request)
  {
      $cond_title = $request->cond_title;
      if ($cond_title != '') {
          $posts = Profile::where('title', $cond_title)->get();
      } else {
          $posts = Profile::all();

update `profiles` set `hobby` = '映画', `introduction` = 'rgdhnfd', `profiles`.`updated_at` = '2020-12-01 07:45:17' where `id` = 4
insert into `profile_histories` (`profile_id`, `edited_at`, `updated_at`, `created_at`) values (1, '2020-12-01 07:43:09', '2020-12-01 07:43:09', '2020-12-01 07:43:09')
---
  public function update(Request $request)
  {
      // Validationをかける
      $this->validate($request, Profile::$rules);
      // Profile Modelからデータを取得する
      $profile = Profile::find($request->id);
      // 送信されてきたフォームデータを格納する
      $profile_form = $request->all();

      unset($profile_form['_token']);

      // 該当するデータを上書きして保存する
      $profile->fill($profile_form)->save();

      // 以下を追記
        $history = new ProfileHistory;
        $history->profile_id = $profile->id;
        $history->edited_at = Carbon::now();
        $history->save();